<h2>Код на html 1</h2>
<? echo "<h1>Welcome!!!</h1>";
   echo (9>7); 	
?>
<h2>Код на html 2</h2>

<?
//Математические операторы
/*
$x = date('d');

$x = $x+1;
$x++;//инкремент
$x+=1;
++$x;
$x--;//декремент

$x*=10;
$x= $x*10;

$x=10 % 3;//1

//Постфиксная форма инкремента
$a = 10;
$b = $a++;
//echo "a=$a<br>b=$b";

//Префиксная форма инкремента
$a = 10;
$b = ++$a;
echo "a=".$a."<br>b=".$b;

$test = "<br>Проект \"САОC\" - самый успешный проект компании";
echo $test;

*/
//Логические операторы

$x = true;//1
$y = false;//0 
/*
x  y  AND(&&)   OR(||)   XOR(^^)
1  1    1         1        0 
1  0    0         1        1
0  1    0         1        1
0  0    0         0        0
*/

//Дома прокомментировать и объяснить почему false!
//$z = !($x && !$y) || (!$x||!$y);
//$z1 = !($x && !$y);
//$z2 = (!$x||!$y);

//echo $z;

//Приведение типов данных

$x = 25.235423;//тип double
$x = (int)$x;
//echo $x;

//Неявное приведение к типу данных

$a = 10;
$b = $a + "5";
//echo $b;

//echo (10==="10");

/*
$test = 1;
unset($test);
echo $test;
*/

$text = "Сегодня ";
$text.="выходной день";
$text.=" суббота";

//echo $text;

//Математические функции

echo rand(1,10);































